app/views/users/_form.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
      </div>
      <% if User.find_by_id(session[:user_id]) and User.find_by_id(session[:user_id]).role == 0 %>