app/views/orders/_form.html.erb

    <div id="error_explanation">
      <%= t('errors.template.header', :count=>@order.errors.size,
	    :model=>t('activerecord.models.order')) %>:
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 980190962 LIMIT 1