app/controllers/admin_controller.rb

  def index
    if current_user.role == 0
      @total_orders = Order.count
---
SELECT COUNT(*) FROM "orders"