app/controllers/carts_controller.rb

  def edit
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 980190962 LIMIT 1

  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2012-07-30 05:47:53.000000', '2012-07-30 05:47:53.000000')

  def update
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 980190962 LIMIT 1