app/controllers/catalogs_controller.rb

SELECT "catalogs".* FROM "catalogs" WHERE "catalogs"."pid" = 'root'
---
  def index

    @catalogs = Catalog.find_all_by_pid("root");

SELECT "catalogs".* FROM "catalogs" WHERE "catalogs"."id" = 11 LIMIT 1
---
  def show
    @catalog = Catalog.find(params[:id])

INSERT INTO "catalogs" ("created_at", "pid", "name", "updated_at") VALUES ('2012-08-10 03:53:07.072695', 'Programming', 'Ruby', '2012-08-10 03:53:07.072695')
---
  def create
    @catalog = Catalog.new(params[:catalog])

    respond_to do |format|
      if @catalog.save