app/controllers/comments_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 5 ORDER BY title LIMIT 1
INSERT INTO "comments" ("product_id", "created_at", "content", "updated_at") VALUES (9, '2012-08-10 04:20:39.071032', 'hello ', '2012-08-10 04:20:39.071032')
---
  def create
      @product = Product.find(params[:product_id])
      @comment = @product.comments.new(params[:comment])
      @comment.user_id = session[:user_id]

      if @comment.save