app/controllers/line_items_controller.rb

  def show
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1

  def edit
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2012-07-30 05:47:53.953125', '2012-07-30 05:47:53.953125')
INSERT INTO "line_items" ("updated_at", "order_id", "product_id", "cart_id", "quantity", "created_at") VALUES ('2012-08-01 06:47:26.062500', NULL, 207281424, 980190963, 1, '2012-08-01 06:47:26.062500')

  def update
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1