app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 2 ORDER BY title LIMIT 1
INSERT INTO "line_items" ("order_id", "product_id", "cart_id", "created_at", "quantity", "updated_at") VALUES (NULL, 10, 49, '2012-08-10 04:35:16.930697', 1, '2012-08-10 04:35:16.930697')
UPDATE "line_items" SET "updated_at" = '2012-08-01 01:52:54.671875', "quantity" = 2 WHERE "line_items"."id" = 13