app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY updated_at DESC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "orders"
---
  def index
    if current_user.role == 0
      @orders = Order.paginate(:page => params[:page], :per_page => 2, :order => 'updated_at DESC')

SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 1)
---
  def new
    if current_cart.line_items.empty?

INSERT INTO "orders" ("email", "name", "pay_type", "updated_at", "created_at", "address") VALUES ('afjadsf@qq.com', 'zhangjian', 'Credit card', '2012-08-01 03:34:07.515625', '2012-08-01 03:34:07.515625', 'afhdasfsda')
DELETE FROM "carts" WHERE "carts"."id" = 18
SELECT "line_items".* FROM "line_items" WHERE ("line_items".cart_id = 18)
---
  def create
    @order = Order.new(params[:order])
    @order.uid = session[:user_id]
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver