app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = 980190962 LIMIT 1
---
  def show
    @order = Order.find(params[:id])

SELECT "orders".* FROM "orders" WHERE "orders"."id" = 980190962 LIMIT 1
---
  def edit
    @order = Order.find(params[:id])

INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2012-07-30 05:47:54.796875', '2012-07-30 05:47:54.796875')
INSERT INTO "orders" ("pay_type", "created_at", "updated_at", "name", "email", "address") VALUES ('Check', '2012-07-30 05:48:08.437500', '2012-07-30 05:48:08.437500', 'Dave Thomas', 'dave@example.com', '123 The Street')
SELECT "line_items".* FROM "line_items" WHERE ("line_items".order_id = 980190963)
---
  def create
    @order = Order.new(params[:order])
    @order.uid = session[:user_id]
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver

SELECT "orders".* FROM "orders" WHERE "orders"."id" = 980190962 LIMIT 1
---
  def update
    @order = Order.find(params[:id])