app/controllers/products_controller.rb

  def show
    @product = Product.find(params[:id])


    if session[:user_id] == nil
        @user = nil
    else
        @user = User.find(session[:user_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 7 ORDER BY title LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def new
    @product = Product.new
    @catalogs = Catalog.find_all_by_pid("root")
---
SELECT "catalogs".* FROM "catalogs" WHERE "catalogs"."pid" = 'root'

  def edit
    @product = Product.find(params[:id])
    @catalogs = Catalog.find_all_by_pid("root")
---
SELECT "products".* FROM "products" WHERE "products"."id" = 5 ORDER BY title LIMIT 1
SELECT "catalogs".* FROM "catalogs" WHERE "catalogs"."pid" = 'root'

  def create
    @product = Product.new(params[:product])
    @catalogs = Catalog.find_all_by_pid("root")

    respond_to do |format|
      if @product.save
---
SELECT "catalogs".* FROM "catalogs" WHERE "catalogs"."pid" = 'root'
INSERT INTO "products" ("description", "title", "created_at", "price", "image_url", "updated_at") VALUES ('系统分析与设计方法》(原书第7版)提供了当前市场上可用的、丰富的系统分析和设计的实例。第7版新增内容：

  def update
    @product = Product.find(params[:id])
    @catalogs = Catalog.find_all_by_pid("root")

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 9 ORDER BY title LIMIT 1
SELECT "catalogs".* FROM "catalogs" WHERE "catalogs"."pid" = 'root'
UPDATE "products" SET "updated_at" = '2012-08-10 04:02:28.996883', "description" = '<p>