app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])
    @catalogs = Catalog.find_all_by_pid("root")

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "price", "updated_at", "created_at", "image_url", "description") VALUES ('Lorem Ipsum', 19.95, '2012-07-30 05:47:55.031250', '2012-07-30 05:47:55.031250', 'lorem.jpg', 'Wibbles are fun !')

  def update
    @product = Product.find(params[:id])
    @catalogs = Catalog.find_all_by_pid("root")

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
UPDATE "products" SET "updated_at" = '2012-08-01 08:08:35.012106', "title" = 'Lorem Ipsum', "price" = 19.95, "image_url" = 'lorem.jpg', "description" = 'Wibbles are fun !' WHERE "products"."id" = 980190962

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 ORDER BY title LIMIT 1
DELETE FROM "products" WHERE "products"."id" = 980190962