app/controllers/store_controller.rb

  def index
    if params[:set_locale]
      redirect_to store_path(:locale => params[:set_locale])
    else
      catalog = params[:catalog]
      if catalog == nil
        @products = Product.all
      else
        @products = []
        catalogs = search catalog
        catalogs.each do |c|
          @products = @products + Product.find_all_by_catalog(c.name)
---
SELECT "products".* FROM "products" ORDER BY title
SELECT "catalogs".* FROM "catalogs" WHERE "catalogs"."name" = 'Discrete Mathematics'
SELECT "products".* FROM "products" WHERE "products"."catalog" = 'Discrete Mathematics' ORDER BY title