app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1

  def create
    @user = User.new(params[:user])
    if current_user == nil or current_user.role !=0
      @user.role = 1
    end

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "hashed_password", "salt", "updated_at", "created_at") VALUES ('sam', '1d6e9418a2c9db15edc84f790e42f976173f8c0d7ad573548abfef8de8a65d58', '-6189311680.315023112694502', '2012-08-01 08:08:35.110408', '2012-08-01 08:08:35.110408')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
UPDATE "users" SET "name" = 'sam', "updated_at" = '2012-07-30 05:47:55.734375', "salt" = '353954040.00917827780614999', "hashed_password" = '57b2a71664ebc95329fd2f5fe3baa85c4caccd4d60d55066fc3538de6234e7f6' WHERE "users"."id" = 980190962

  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 980190962