app/views/products/_form.html.erb

SELECT "products".* FROM "products" WHERE "products"."id" = 5 ORDER BY title LIMIT 1
---
    <div id="error_explanation">
      <%= t('errors.template_product.header', :count=>@product.errors.size,
	     :model=>t('.activerecord.models.product')) %>

SELECT "catalogs".* FROM "catalogs" WHERE "catalogs"."pid" = 'root'
---

  document.getElementById("hide_catalog").value = elem.value;