app/views/products/show.html.erb

<h3><%= t('.Comments') %></h3>
<% @product.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE ("comments".product_id = 5)

    <div id="comment_interval"></div>
    <div id="commenter"><strong><%=  User.find_by_id(comment.user_id).name  %></strong></div>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1